<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;


class ProductsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run()
    {
        DB::table('products')->insert([
            [
                'name' => 'العباءة لون جميل بصلي للصلاة للنساء',
                'category_id' => 2,
                // Assuming you have a category with id 1
                'image' => 'seed/11.jpg',
                'description' => 'هذه العباءة مصممة خصيصاً للنساء المسلمات لاستخدامها خلال أداء الصلاة. تتميز بتصميمها الواحد والذي يجعلها سهلة الارتداء ومريحة خلال الصلاة. تأتي مع غطاء للرأس (هود) لتوفير الخصوصية خلال الصلاة',
                'longDescription' => 'هذه العباءة الواحدة للصلاة مصممة بعناية لتلبية احتياجات النساء المسلمات في المملكة العربية السعودية. تأتي بتصميم واحد يجعلها مريحة وسهلة الارتداء، مما يسهل على المرأة القيام بواجبها الديني بكل يسر وسلاسة. العباءة مصنوعة من مواد عالية الجودة توفر الراحة والتهوية أثناء الصلاة. كما أنها مجهزة بغطاء للرأس (هود) يوفر الخصوصية التامة خلال الصلاة.',
                'stock_quantity' => 10,
                'price' => 20,
                'status' => 1,
                'image1' => 'seed/12.jpg',
                'image2' => 'seed/13.jpg',
                'image3' => 'seed/14.jpg',
                'image4' => 'seed/15.jpg',
                // 'image5' => 'image5p1.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'العباءة لون جميل أسود لخارج المنزل',
                'category_id' => 2,
                // Assuming you have a category with id 1
                'image' => 'seed/21.jpg',
                'description' => 'هذه العباءة مصممة خصيصاً للنساء المسلمات لاستخدامها خلال أداء الصلاة. تتميز بتصميمها الواحد والذي يجعلها سهلة الارتداء ومريحة خلال الصلاة. تأتي مع غطاء للرأس (هود) لتوفير الخصوصية خلال الصلاة',
                'longDescription' => 'هذه العباءة الواحدة للصلاة مصممة بعناية لتلبية احتياجات النساء المسلمات في المملكة العربية السعودية. تأتي بتصميم واحد يجعلها مريحة وسهلة الارتداء، مما يسهل على المرأة القيام بواجبها الديني بكل يسر وسلاسة. العباءة مصنوعة من مواد عالية الجودة توفر الراحة والتهوية أثناء الصلاة. كما أنها مجهزة بغطاء للرأس (هود) يوفر الخصوصية التامة خلال الصلاة.',
                'stock_quantity' => 10,
                'price' => 30,
                'status' => 1,
                'image1' => 'seed/22.jpg',
                'image2' => 'seed/23.jpg',
                'image3' => 'seed/24.jpg',
                'image4' => 'seed/25.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'العباءة لون جميل للصلاة للنساء',
                'category_id' => 2,
                // Assuming you have a category with id 1
                'image' => 'seed/31.jpg',
                'description' => 'هذه العباءة مصممة خصيصاً للنساء المسلمات لاستخدامها خلال أداء الصلاة. تتميز بتصميمها الواحد والذي يجعلها سهلة الارتداء ومريحة خلال الصلاة. تأتي مع غطاء للرأس (هود) لتوفير الخصوصية خلال الصلاة',
                'longDescription' => 'هذه العباءة الواحدة للصلاة مصممة بعناية لتلبية احتياجات النساء المسلمات في المملكة العربية السعودية. تأتي بتصميم واحد يجعلها مريحة وسهلة الارتداء، مما يسهل على المرأة القيام بواجبها الديني بكل يسر وسلاسة. العباءة مصنوعة من مواد عالية الجودة توفر الراحة والتهوية أثناء الصلاة. كما أنها مجهزة بغطاء للرأس (هود) يوفر الخصوصية التامة خلال الصلاة.',
                'stock_quantity' => 30,
                'price' => 30,
                'status' => 1,
                'image1' => 'seed/32.jpg',
                'image2' => 'seed/33.jpg',
                'image3' => 'seed/34.jpg',
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'شال للرأس لون أزرق سماوي',
                'category_id' => 2, // Assuming you have a category with id 2
                'image' => 'seed/41.jpg',
                'description' => 'هذا الشال مصمم خصيصًا ليكون إكمالًا مثاليًا لإطلالتك اليومية. بلونه الأزرق السماوي، يضفي هذا الشال لمسة من الأناقة والجمال على إطلالتك. مصنوع من خامات عالية الجودة لتوفير الراحة والأناقة في آن واحد.',
                'longDescription' => 'اجعلي إطلالتك أنيقة ومميزة مع هذا الشال اللون الأزرق السماوي. يمكنك ارتداء هذا الشال بأكثر من طريقة، مما يمنحك مرونة في التنسيق مع ملابسك. إن لونه الجميل يضفي لمسة من الأناقة والفخامة إلى إطلالتك اليومية. يتميز الشال بنسيجه الناعم والمريح، مما يجعله خيارًا مثاليًا للاستخدام اليومي. 
هذا الشال ليس مجرد إكسسوار، بل هو تعبير عن الذوق والأناقة. يمكنك ارتداؤه في مناسباتك الخاصة أو في يومك العادي ليضفي لمسة جمالية إلى إطلالتك. بفضل تصميمه المتميز وجودته العالية، سيبقى هذا الشال جزءًا لا يتجزأ من مجموعة إكسسواراتك. 
احصلي على هذا الشال الرائع الآن واستمتعي بتحول إطلالتك إلى مستوى جديد من الأناقة والفخامة. يأتي بتعددية الاستخدامات والجودة الفائقة، مما يجعله اختيارك الأمثل في عالم الإكسسوارات.',
                'stock_quantity' => 75,
                'price' => 8,
                'status' => 1,
                'image1' => 'seed/42.jpg',
                'image2' => 'seed/43.jpg',
                'image3' => 'seed/44.jpg',
                'image4' => 'seed/45.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'شال للرأس وردي جودة عالية',
                'category_id' => 2, // Assuming you have a category with id 2
                'image' => 'seed/51.jpg',
                'description' => 'اضف لمسة من الأنوثة والرقي إلى إطلالتك مع هذا الشال الوردي عالي الجودة. يتميز بتصميم أنيق ولون جذاب يمنحك إطلالة رائعة في جميع المناسبات.',
                'longDescription' => 'هذا الشال الوردي ذو الجودة العالية هو خيار مثالي للنساء اللاتي يبحثن عن الأناقة والراحة في آن واحد. مصنوع من خامات عالية الجودة توفر لك الدفء والراحة في الأيام الباردة. يمكنك ارتداء هذا الشال بأسلوب مختلف وتنسيقه مع ملابسك بطرق متعددة، مما يجعله إضافة رائعة لمجموعتك.',
                'stock_quantity' => 20,
                'price' => 13,
                'status' => 1,
                'image1' => 'seed/52.jpg',
                'image2' => 'seed/53.jpg',
                'image3' => 'seed/54.jpg',
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'شال أسود أنيق للمسلمة الشابة جودة عالية',
                'category_id' => 2, // Assuming you have a category with id 2
                'image' => 'seed/61.jpg',
                'description' => 'أضفي لمسة من الأناقة والفخامة إلى إطلالتك مع هذا الشال الأسود الأنيق. مصمم خصيصًا لتناسب المسلمات الشابات ويتميز بجودة عالية وتصميم محافظ يلبي احتياجات المرأة المحجبة.',
                'longDescription' => 'هذا الشال الأسود الأنيق هو اختيار مثالي للمسلمة الشابة التي تبحث عن توازن بين الأناقة والحشمة. يأتي بتصميم فريد وجودة عالية توفر الراحة طوال اليوم. يمكنك ارتداء هذا الشال بمختلف الطرق لتلائم مختلف المناسبات والأوقات. اجعلي إطلالتك مميزة بهذا الشال الراقي.',
                'stock_quantity' => 18,
                'price' => 10,
                'status' => 1,
                'image1' => 'seed/62.jpg',
                'image2' => 'seed/63.jpg',
                'image3' => null,
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'جلباب فوشي أنيق للمسلمة الشابة جودة عالية',
                'category_id' => 2, // Assuming you have a category with id 2
                'image' => 'seed/71.jpg',
                'description' => 'أضفي لمسة من الفخامة والأناقة إلى إطلالتك اليومية مع هذا الجلباب الفوشي الأنيق. تصميم راقٍ مصمم خصيصًا لتناسب المسلمات الشابات، مع جودة عالية لضمان الراحة والأناقة.',
                'longDescription' => 'يعتبر هذا الجلباب الفوشي الأنيق من أفضل الخيارات للمسلمة الشابة التي تهتم بالمظهر والجودة. يأتي بلون فوشي جذاب يمزج بين الأناقة والحيوية. مصنوع من خامات عالية الجودة توفر الراحة القصوى، ويتميز بتفاصيل أنيقة تضفي لمسة فاخرة. يمكن ارتداؤه في المناسبات الخاصة واليوميات لتحصلي على إطلالة راقية ومحتشمة.',
                'stock_quantity' => 15,
                'price' => 50,
                'status' => 1,
                'image1' => 'seed/72.jpg',
                'image2' => 'seed/73.jpg',
                'image3' => 'seed/74.jpg',
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'جلباب خمري رائع للمسلمة الشابة جودة عالية',
                'category_id' => 2, // Assuming you have a category with id 2
                'image' => 'seed/81.jpg',
                'description' => 'أضفي لمسة من الرقي والفخامة إلى مظهرك اليومي مع هذا الجلباب الخمري الرائع. تصميم فريد مصمم خصيصًا لتلبية احتياجات المسلمة الشابة، مع جودة عالية لتوفير الراحة والأناقة.',
                'longDescription' => 'استمتعي بإطلالة مميزة مع هذا الجلباب الخمري الرائع، حيث يجمع بين الأناقة والتصميم الراقي. مصنوع من خامات عالية الجودة لضمان الراحة والمتانة. يتميز بلون خمري جذاب يضفي لمسة من الفخامة. يمكن ارتداؤه في المناسبات الخاصة واليوميات، مما يجعله إضافة لا غنى عنها في خزانتك.',
                'stock_quantity' => 18,
                'price' => 55,
                'status' => 1,
                'image1' => 'seed/82.jpg',
                'image2' => 'seed/83.jpg',
                'image3' => null,
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'حجاب أميرة ذهبي مميز',
                'category_id' => 2, // Assuming you have a category with id 2
                'image' => 'seed/91.jpg',
                'description' => 'أبرزي أناقتك وجمالك مع هذا الحجاب الأميرة الذهبي المميز. تصميم رائع يجمع بين الفخامة والأناقة، مما يجعله اختيارًا مثاليًا للمرأة العصرية.',
                'longDescription' => 'اشعري بسحر الأميرات مع هذا الحجاب الذهبي المميز، حيث يتميز بتفاصيل فاخرة وجودة استثنائية. اللون الذهبي يضفي لمسة من الفخامة والسحر على إطلالتك. مصنوع من خامات عالية الجودة توفر الراحة طوال اليوم. يمكن ارتداؤه في المناسبات الخاصة والفعاليات الرسمية لتتألقي بأناقة فريدة.',
                'stock_quantity' => 60,
                'price' => 9,
                'status' => 1,
                'image1' => 'seed/92.jpg',
                'image2' => null,
                'image3' => null,
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'زينة رمضان فوانيس رائعة',
                'category_id' => 3, // Assuming you have a category with id 3 for Ramadan decorations
                'image' => 'seed/211.webp',
                'description' => 'أضف سحرًا خاصًا إلى منزلك خلال شهر رمضان المبارك مع هذه الزينة الرائعة لفوانيس رمضان. تصميمات فريدة تضفي جوًا خاصًا وساحرًا للاحتفال بأيام الشهر الكريم.',
                'longDescription' => 'اجعل منزلك يشع بالبهجة والسرور في شهر رمضان مع زينة الفوانيس الرائعة. هذه المجموعة تتميز بتصاميم مبتكرة وفريدة، مصممة خصيصًا لإضفاء أجواء رمضانية خاصة. الفوانيس مصنوعة بجودة عالية لتدوم طويلًا وتضفي لمسة من الأناقة على أي مكان توضع فيه. استمتع بإضاءة فاتنة وجميلة تعكس جو الاحتفال بشهر الصيام.',
                'stock_quantity' => 25,
                'price' => 45,
                'status' => 1,
                'image1' => 'seed/212.webp',
                'image2' => 'seed/213.webp',
                'image3' => 'seed/214.webp',
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'لبسة العيد للأطفال الرائعين',
                'category_id' => 3, // Assuming you have a category with id 4 for Eid outfits
                'image' => 'seed/221.webp',
                'description' => 'اجعلوا أطفالكم يتألقون في عيد الفطر المبارك مع هذه اللبسة الرائعة. تصاميم مبهجة وألوان جذابة تخلق أجواء احتفالية وجميلة لهذا المناسبة السعيدة.',
                'longDescription' => 'احتفلوا بعيد الفطر مع أطفالكم بأناقة وفخر مع لبسة العيد الرائعة. تتميز هذه المجموعة بتصاميم مميزة وأقمشة فاخرة تجعل أطفالكم يشعرون بالراحة والأناقة في نفس الوقت. تتنوع الألوان والأشكال لتلبي اختيارات الصغار والكبار على حد سواء. اجعلوا هذا العيد يوماً لا يُنسى لأحبائكم مع لبسة العيد للأطفال الرائعين.',
                'stock_quantity' => 30,
                'price' => 55,
                'status' => 1,
                'image1' => 'seed/222.webp',
                'image2' => 'seed/223.webp',
                'image3' => 'seed/224.webp',
                'image4' => 'seed/225.webp',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'وسادات رمضانية متميزة',
                'category_id' => 3, // Assuming you have a category with id 5 for Ramadan-themed cushions
                'image' => 'seed/231.webp',
                'description' => 'أضيفوا لمسة من السحر إلى منزلكم في شهر رمضان المبارك مع هذه الوسادات الرمضانية المتميزة. تصاميم فريدة وألوان دافئة تضفي جوًا رمضانيًا خاصًا.',
                'longDescription' => 'اجعلوا منزلكم يشع بأجواء رمضان مع وسادات رمضانية متميزة. تتميز هذه الوسادات بتصاميم متفردة تحمل رموزًا رمضانية جميلة وكلمات تهنئة بالشهر الكريم. مصنوعة من أقمشة عالية الجودة توفر الراحة أثناء الجلوس. يمكنكم وضعها في غرفة المعيشة أو غرفة النوم لتجعلوا كل لحظة في منزلكم تنبض بروح رمضان.',
                'stock_quantity' => 25,
                'price' => 4,
                'status' => 1,
                'image1' => 'seed/232.webp',
                'image2' => 'seed/233.webp',
                'image3' => 'seed/234.webp',
                'image4' => 'seed/235.webp',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'حبل إنارة زينة رمضانية',
                'category_id' => 3, // Assuming you have a category with id 6 for Ramadan-themed string lights
                'image' => 'seed/241.webp',
                'description' => 'أضف سحرًا إلى منزلك في شهر رمضان المبارك مع حبل الإنارة الرمضاني. تصميم فريد وألوان دافئة يضفيان جوًا احتفاليًا رائعًا في كل زاوية.',
                'longDescription' => 'جددوا أجواء رمضان في منازلكم مع حبل الإنارة الرمضاني الرائع. يتميز هذا الحبل بتصميم استثنائي يحمل في طياته رموزًا رمضانية وزينات جميلة. يمكن استخدامه لتزيين غرفة المعيشة أو الفناء الخارجي لإضفاء لمسة ساحرة ودافئة. الألوان الدافئة والتصميم المميز يجعلان هذا الحبل مثاليًا لتزيين أمسيات الصلاة ولحظات الافطار الرمضانية.',
                'stock_quantity' => 29,
                'price' => 10,
                'status' => 1,
                'image1' => 'seed/242.webp',
                'image2' => 'seed/243.webp',
                'image3' => 'seed/244.webp',
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'ستاند للمصحف الشريف خشب مميز',
                'category_id' => 1, // Assuming you have a category with id 1 for Quran stands
                'image' => 'seed/301.jpg',
                'description' => 'أضف لمسة من الأناقة والتميز إلى مكتبك أو مكانك المخصص للعبادة مع هذا الستاند الخشبي للمصحف الشريف. تصميم مميز يجمع بين الجمال والفعالية.',
                'longDescription' => 'جدد مكانك المخصص للعبادة مع هذا الستاند الخشبي المميز للمصحف الشريف. يتميز بتصميم فريد من الخشب الفاخر، يعكس الأصالة والجمال في آن واحد. الستاند يوفر مكانًا مثاليًا لوضع المصحف أثناء القراءة، مع الحفاظ على الجمالية والتنظيم. استمتع بأجواء هادئة ومريحة خلال قراءتك للمصحف الشريف.',
                'stock_quantity' => 33,
                'price' => 14,
                'status' => 1,
                'image1' => 'seed/302.jpg',
                'image2' => 'seed/303.jpg',
                'image3' => 'seed/304.jpg',
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'مصحف مطرز لون خمري مميز ذو جودة عالية',
                'category_id' => 1, // Assuming you have a category with id 1 for embroidered Qurans
                'image' => 'seed/311.jpg',
                'description' => 'أضف لمسة فاخرة إلى قراءتك للقرآن الكريم مع هذا المصحف المطرز بلون خمري مميز. تفاصيل دقيقة وجودة عالية تجعل هذا المصحف اختيارًا رائعًا لكل محب للقراءة.',
                'longDescription' => 'استمتع بتلاوة القرآن بأناقة فريدة مع هذا المصحف المميز بلون خمري وتفاصيل مطرزة بدقة. يتميز المصحف بجودة عالية في الطباعة والورق، مما يجعل تجربة القراءة فريدة وممتعة. التفاصيل المطرزة تضيف لمسة جمالية وفخامة إلى المصحف، مما يجعله هدية مثالية للأحباء. استمتع بالقراءة بأناقة وسكينة مع هذا المصحف الذي يجمع بين الجمال والجودة العالية.',
                'stock_quantity' => 12,
                'price' => 40,
                'status' => 1,
                'image1' => 'seed/312.jpg',
                'image2' => 'seed/313.jpg',
                'image3' => 'seed/314.jpg',
                'image4' => 'seed/316.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'مصحف مطرز لون أسود على شكل الكعبة',
                'category_id' => 1, // Assuming you have a category with id 1 for embroidered Qurans
                'image' => 'seed/321.jpg',
                'description' => 'تحفة فنية فريدة من نوعها! استمتع بقراءة القرآن الكريم مع هذا المصحف الرائع بلون أسود ومطرز بشكل الكعبة المشرفة. تصميم مميز يعكس الجمال والتفرد.',
                'longDescription' => 'احصل على تجربة قراءة فريدة مع هذا المصحف المطرز بلون أسود وبتصميم يحاكي شكل الكعبة المشرفة. يتميز المصحف بتفاصيل دقيقة وفنية تعكس روعة الفن الإسلامي. اللون الأسود يضفي لمسة من الجمال والجاذبية، وتفاصيل الكعبة تضيف قيمة رمزية ودينية. يعتبر هذا المصحف هدية فاخرة وفريدة لكل من يبحث عن تقدير فني وديني في واحد.',
                'stock_quantity' => 10,
                'price' => 90,
                'status' => 1,
                'image1' => 'seed/322.jpg',
                'image2' => 'seed/323.jpg',
                'image3' => 'seed/324.jpg',
                'image4' => 'seed/325.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'ستاند خشبي للمصحف الشريف أصلي',
                'category_id' => 1, // Assuming you have a category with id 1 for Quran stands
                'image' => 'seed/331.jpg',
                'description' => 'اجعل تلاوتك للقرآن تجربة فريدة مع هذا الستاند الخشبي الأصلي للمصحف الشريف. تصميم أنيق وجودة عالية يجمعان بين الرفاهية والتقديس.',
                'longDescription' => 'تأمل في كلمات الله بأسلوب أنيق ومميز مع هذا الستاند الخشبي الأصلي للمصحف الشريف. صُنع هذا الستاند بعناية فائقة من الخشب الأصلي، مما يمنحه مظهرًا راقيًا وجودة عالية. يتيح لك الستاند وضع المصحف بشكل مستقيم ومريح أثناء قراءتك وتدبرك للآيات. اجعل من وقت قراءتك للقرآن لحظة مميزة ومريحة مع هذا الستاند الخشبي الراقي.',
                'stock_quantity' => 18,
                'price' => 60,
                'status' => 1,
                'image1' => 'seed/332.jpg',
                'image2' => 'seed/333.jpg',
                'image3' => null,
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'كتاب الحديث صحيح البخاري',
                'category_id' => 1, // Assuming you have a category with id 7 for Hadith books
                'image' => 'seed/341.jpg',
                'description' => 'احتفظ بكنز من كتب الحديث مع صحيح البخاري، الكتاب الشهير الذي جمع فيه الإمام البخاري أحاديث صحيحة عن النبي محمد صلى الله عليه وسلم. تعتبر هذه الروايات من بين أصح الأحاديث النبوية.',
                'longDescription' => 'استمتع بدراسة أصح الأحاديث النبوية مع كتاب "صحيح البخاري". صُنع هذا الكتاب الشهير على يد الإمام البخاري ويعتبر من أهم مصادر الحديث الصحيحة في الإسلام. يحتوي الكتاب على آلاف الأحاديث التي تم اختيارها بعناية من قبل الإمام البخاري لضمان صحتها وصدقها. تمثل هذه الروايات مصدرًا قيمًا للمسلمين لفهم السنة النبوية والتعلم من تجارب حياة النبي محمد صلى الله عليه وسلم.',
                'stock_quantity' => 25,
                'price' => 40,
                'status' => 1,
                'image1' => 'seed/342.jpg',
                'image2' => 'seed/343.jpg',
                'image3' => 'seed/344.jpg',
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'كتاب الأحاديث القدسية',
                'category_id' => 1, // Assuming you have a category with id 7 for Hadith books
                'image' => 'seed/351.jpg',
                'description' => 'استمتع بقراءة ودراسة الأحاديث القدسية مع هذا الكتاب الفريد الذي يجمع بين الروحانية والحكمة الإلهية. يضم الكتاب الأحاديث التي نقلها النبي محمد صلى الله عليه وسلم عن الله بلغة خاصة.',
                'longDescription' => 'استمتع برحلة في عمق الأحاديث القدسية مع هذا الكتاب الذي يقدم لك مفاهيم روحانية مميزة. الأحاديث القدسية هي الأحاديث التي نقلها النبي محمد صلى الله عليه وسلم عن الله بلغة خاصة تحمل الحكمة الإلهية والتوجيه الروحي. يتناول الكتاب مجموعة من هذه الأحاديث بشكل دقيق ومنظم، موضحًا الفوائد الروحية والدروس الحياتية التي يمكن انتزاعها منها. اجعل هذا الكتاب جزءًا من مكتبتك لفهم أعماق الحديث القدسي والتأمل في رسائله الربانية.',
                'stock_quantity' => 20,
                'price' => 45,
                'status' => 1,
                'image1' => 'seed/352.jpg',
                'image2' => 'seed/353.jpg',
                'image3' => 'seed/354.jpg',
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'ستاند مصحف معدني طويل للإمام',
                'category_id' => 1, // Assuming you have a category with id 1 for Quran stands
                'image' => 'seed/361.jpg',
                'description' => 'اجعل قراءتك للقرآن تجربة مريحة مع هذا الستاند المعدني الطويل الذي صمم خصيصًا للاستخدام من قبل الإمام. تصميم فريد وجودة عالية يجمعان بين الراحة والأناقة.',
                'longDescription' => 'استمتع بتلاوة القرآن براحة مع هذا الستاند المعدني الطويل المصمم خصيصًا للاستخدام من قبل الإمام. يعتبر هذا الستاند إضافة رائعة إلى المسجد أو المكان المخصص للصلاة، حيث يتميز بتصميمه الطويل الذي يتيح للإمام راحة القراءة والتلاوة لفترات طويلة. يصنع من المعدن عالي الجودة لضمان المتانة والاستدامة. احرص على توفير أفضل تجربة للإمام والمصلين مع هذا الستاند المميز.',
                'stock_quantity' => 15,
                'price' => 95,
                'status' => 1,
                'image1' => 'seed/362.jpg',
                'image2' => 'seed/363.jpg',
                'image3' => 'seed/364.jpg',
                'image4' => 'seed/365.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'سجادة صلاة متميزة لجميع الأماكن',
                'category_id' => 1, // Assuming you have a category with id 3 for prayer rugs
                'image' => 'seed/371.jpg',
                'description' => 'استمتع براحة وجمال فريد مع هذه السجادة المتميزة المصممة خصيصًا للصلاة. تصميم أنيق وجودة عالية تجعلها مناسبة لجميع الأماكن، سواء في المسجد أو في المنزل.',
                'longDescription' => 'اجعل لحظات صلاتك تجربة مريحة وفريدة مع هذه السجادة المتميزة. تصميمها الأنيق والجودة العالية يجعلانها مناسبة لجميع الأماكن، سواء كنت في المنزل، المكتب، أو حتى في السفر. مصنوعة من مواد عالية الجودة لتوفير الراحة والمتانة، مع تفاصيل فنية دقيقة تضفي لمسة جمالية على مكان صلاتك. اختر هذه السجادة لتجعل كل صلاة لحظة مميزة ومريحة.',
                'stock_quantity' => 20,
                'price' => 25,
                'status' => 1,
                'image1' => 'seed/372.jpg',
                'image2' => 'seed/373.jpg',
                'image3' => 'seed/374.jpg',
                'image4' => 'seed/375.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'سجادة صلاة مبطنة لكبار السن',
                'category_id' => 1, // Assuming you have a category with id 3 for prayer rugs
                'image' => 'seed/381.jpg',
                'description' => 'اجعل لحظات صلاتك مريحة ومميزة مع هذه السجادة المبطنة المصممة خصيصًا لكبار السن. توفر الراحة والدعم اللازم لتجعل صلاتهم تجربة سهلة ومريحة.',
                'longDescription' => 'تمتع بلحظات صلاتك براحة فائقة مع هذه السجادة المبطنة المصممة خصيصًا لكبار السن. توفر البطانة الرقيقة والناعمة دعمًا إضافيًا للركب والظهر، مما يجعل الصلاة تجربة مميزة وخالية من الإجهاد. السجادة مصنوعة من مواد عالية الجودة لضمان المتانة والراحة الطويلة الأمد. اجعل كل صلاة تجربة مريحة ومميزة مع هذه السجادة المصممة لكبار السن.',
                'stock_quantity' => 15,
                'price' => 19,
                'status' => 1,
                'image1' => 'seed/382.jpg',
                'image2' => 'seed/383.jpg',
                'image3' => null,
                'image4' => null,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'باكيج المسلم المتكامل لون أسود',
                'category_id' => 1, // Assuming you have a category with id 4 for Muslim packages
                'image' => 'seed/391.jpg',
                'description' => 'احصل على باكيج متكامل يلبي احتياجاتك كمسلم بلون أسود أنيق. يحتوي الباكيج على مجموعة متنوعة من المنتجات التي تسهل عليك أداء العديد من النشاطات الدينية بكل يسر وراحة.',
                'longDescription' => 'استمتع بتجربة مسلم متكاملة مع هذا الباكيج الأنيق بلون أسود. يحتوي الباكيج على سلسلة من المنتجات المصممة خصيصًا لتسهيل حياة المسلم اليومية. يشمل الباكيج عادةً ملابس متنوعة، ومصاحف مطرزة، وسجادة صلاة مريحة، وغيرها من الملحقات الهامة. اللون الأسود يمنح الباكيج لمسة عصرية وأنيقة. احصل على هذا الباكيج وتمتع بالراحة والأناقة في أداء النشاطات الدينية اليومية.',
                'stock_quantity' => 3,
                'price' => 50,
                'status' => 1,
                'image1' => 'seed/392.jpg',
                'image2' => 'seed/393.jpg',
                'image3' => 'seed/394.jpg',
                'image4' => 'seed/395.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ]

















        ]);
    }

}
